const questions = [
  {
    id: 1,
    text: `1. Савол:\nРақамли иқтисод ва рақамли бозор имкониятларидан фойдаланиш бўйича ўз билим ва кўникмаларингизни қандай баҳолайсиз?`,
    options: [
      { label: "A", text: "Бу йўналишда ҳали етарли маълумотга эга эмасман" },
      {
        label: "B",
        text: "Асосий тушунчаларни биламан, лекин амалиётда тўлиқ қўлламайман",
      },
      {
        label: "C",
        text: "Етарли билим ва тажрибага эгаман, бизнесда фойдаланаман",
      },
      {
        label: "D",
        text: "Рақамли имкониятлардан фаол фойдаланаман ва бошқаларга ҳам маслаҳат бера оламан",
      },
    ],
    type: "choice",
  },
  {
    id: 2,
    text: `2. Савол:\nКорхонада иш жараёнлари учун барқарор интернет мавжудми?`,
    options: [
      {
        label: "A",
        text: "Ҳа, интернет доимий ва узилишсиз ишлайди, барча ходимлар фойдаланади",
      },
      {
        label: "B",
        text: "Интернет бор, лекин баъзан узилишлар бўлади, тезлиги юқори эмас",
      },
      {
        label: "C",
        text: "Интернет бор, лекин фақат айрим жойларда ёки айрим ходимлар фойдаланади",
      },
      { label: "D", text: "Йўқ, доимий интернет уланиши мавжуд эмас" },
    ],
    type: "choice",
  },
  {
    id: 3,
    text: `3. Савол:\nКорхона ходимлари компьютер ва бошқа ахборот технологиялари (ноутбук, компьютер, планшет, принтер ва ҳ.к.) билан қай даражада таъминланган?`,
    options: [
      {
        label: "A",
        text: "Барча ходимлар тўлиқ таъминланган ва доимий фойдаланади.",
      },
      {
        label: "B",
        text: "Аксарият ходимлар таъминланган, лекин ҳаммаси эмас",
      },
      {
        label: "C",
        text: "Фақат айрим ходимлар (масалан, бухгалтерия ёки офис қисми) фойдаланади",
      },
      {
        label: "D",
        text: "Амалда компьютер техникаси етарли эмас ёки умуман мавжуд эмас",
      },
    ],
    type: "choice",
  },
  {
    id: 4,
    text: `4. Савол:\nКорхона бухгалтериясини юритишда кандай дастурдан фойдаланилади?`,
    options: [
      { label: "A", text: "Қўлда юритилади" },
      { label: "B", text: "Excel ёки оддий дастур" },
      { label: "C", text: "Профессионал дастур (1C ва бошқалар)" },
      { label: "D", text: "Интеграциялашган автоматлаштирилган тизим" },
    ],
    type: "choice",
  },
  {
    id: 5,
    text: `5. Савол:\nКорхонада омбор ҳисобини юритишда автоматлаштирилган дастурдан қай даражада фойдаланасиз?`,
    options: [
      {
        label: "A",
        text: "Омбор ҳисоби қўлда (дафтар ёки қоғоз орқали) юритилади",
      },
      { label: "B", text: "Excel ёки оддий электрон жадвал орқали юритилади" },
      {
        label: "C",
        text: "Махсус омбор дастури (масалан, 1C, Smartup ва ҳ.к.) орқали юритилади",
      },
      {
        label: "D",
        text: "Омбор ҳисоби бухгалтерия ва сотув тизими билан интеграция қилинган тўлиқ автоматлаштирилган тизим орқали юритилади",
      },
    ],
    type: "choice",
  },
  {
    id: 6,
    text: `6. Савол:\nКорхонада мижозлар билан муносабатларни бошқаришда дастурий таъминотдан қай даражада фойдаланасиз?`,
    options: [
      {
        label: "A",
        text: "Мижозлар ҳисоби қўлда (дафтар ёки шахсий ёзувлар орқали) юритилади",
      },
      { label: "B", text: "Excel ёки оддий электрон жадвал орқали юритилади" },
      { label: "C", text: "Махсус дастур ёки CRM тизимидан фойдаланилади" },
      {
        label: "D",
        text: "CRM тизими сотув, маркетинг ва бухгалтерия билан интеграция қилинган ҳолда тўлиқ автоматлаштирилган",
      },
    ],
    type: "choice",
  },
  {
    id: 7,
    text: `7. Савол:\nКорхона маҳсулот ёки хизматларини онлайн каналлар (ижтимоий тармоқлар, marketplace, веб-сайт, онлайн реклама) орқали қай даражада сотади?`,
    options: [
      {
        label: "A",
        text: "Онлайн савдо йўқ, асосан анъанавий усулда ишлаймиз",
      },
      {
        label: "B",
        text: "Ижтимоий тармоқ ёки сайт бор, лекин савдо асосий эмас",
      },
      {
        label: "C",
        text: "Онлайн савдо фаол олиб борилади (ижтимоий тармоқ, marketplace ёки сайт орқали)",
      },
      {
        label: "D",
        text: "Онлайн савдо асосий канал ҳисобланади ва реклама ҳамда аналитика асосида бошқарилади",
      },
    ],
    type: "choice",
  },
  {
    id: 8,
    text: `8. Савол:\nКорхонада мижозлар базаси, рақамли режалаштириш ва IT масъуллик қай даражада йўлга қўйилган?`,
    options: [
      {
        label: "A",
        text: "Рақамли бошқарув амалда йўқ (мижозлар базаси ва IT тизими шаклланмаган)",
      },
      {
        label: "B",
        text: "Айрим элементлар мавжуд (телефон рўйхати ёки норасмий режа), лекин тизимли эмас",
      },
      {
        label: "C",
        text: "Мижозлар электрон базаси ва ёзма рақамли режа бор, масъул шахс белгиланган",
      },
      {
        label: "D",
        text: "CRM асосида ишлайдиган, амалий рақамли стратегия ва IT бўлими мавжуд",
      },
    ],
    type: "choice",
  },
  {
    id: 9,
    text: `9. Савол:\nКорхонада маълумотларни сақлаш, ҳимоя қилиш ва таҳлил қилишда IT буйича маъсул шахс борми?`,
    options: [
      { label: "A", text: "Ҳа бор, бўлим шуғулланади" },
      { label: "B", text: "Ҳа бор маъсул шахс шуғулланади" },
      { label: "C", text: "Ҳа бор, юклатилган шахс шуғулланади" },
      { label: "D", text: "Бўлим ҳам маъсул ҳам мавжуд эмас" },
    ],
    type: "choice",
  },
  {
    id: 10,
    text: `10. Савол:\nКорхона фаолиятини рақамлаштириш ва автоматлаштиришни ривожлантириш бўйича қандай таклиф ва фикрларингиз бор?\n(Масалан: давлат қўллаб-қувватлаши, молиявий ёрдам, IT мутахассислар, ўқув дастурлари, инфратузилма ва бошқалар)`,
    type: "text",
  },
];

module.exports = questions;
